[
  {
      "grouping":"Software Development",
      "skills":[
        {"name":"Software Development","image":"img/Development.gif", "Description": "I have extensive experience programming in a wide variety of languages including [Python, Java, Javascript, HTML, C++, MATLAB, Simulink, LabVIEW] and I'm familiar with a wide variety of libraries including [SciPy, Pandas, NumPy, Matplotlib, Scikit-Learn, Selenium, PyTest, OpenCV, TensorFlow, PyTorch]."}
      ]
  },

  {
      "grouping":"Robotics",
      "skills":[
        {"name":"Robotics & Microcontrollers","image":"img/Robots.jpeg", "Description": "I designed large-scale industrial automation solutions with FANUC and Universal Robots while programming with Robotics Operating System (ROS), Karel, and TP. I've also built proof of concept's and contributed to projects with Arduino and Raspberry Pi."}
      ]
  },
  {
      "grouping":"Collaborative Tools",
      "skills":[
        {"name":"Collaborative Tools","image":"img/Tools.jpeg", "Description": "The large majority of my work has been in Agile environments operating under Scrum or Lean management principles while contributing and versioning with Git. I'm a certified Professional Scrum Master adept at using management tools including Jira and Confluence."}
      ]
  },
    {
      "grouping":"Cloud & DevOps",
      "skills":[
        {"name":"Cloud & DevOps","image":"img/CloudTech.jpeg", "Description": "I am a certified professional Google Cloud Architect with experience working in cloud platforms including Google Cloud Platform, Amazon Web Services and Open Telekom Cloud. I've also contributed to DevOps practices with tools including Docker, Balena OS, CI/CD pipelines, Terraform and Ansible."}
      ]
  },

  {
      "grouping":"Languages",
      "skills":[
        {"name":"Languages","image":"img/Languages.png", "Description": "Feel free to reach out in any of the following languages: {English: Native, Arabic: Native, German: Professional, French: Basic}."}
      ]
  },
  {
      "grouping":"Computer Aided Design & Simulation",
      "skills":[
        {"name":"Computer Aided Design & Simulation","image":"img/CAD.jpg", "Description": "I have designed models and simulations with SolidWorks, AutoCAD, Blender, Adobe Illustrator, ANSYS, and COMSOL."}
      ]
  }
  ]